//ZSALLOC JOB (ACCT),'ZSCH LAB01 ALLOC',
//             CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//* Z/OS BATCH SCHEDULER
//* LAB 01 - INITIAL DATA SET INFRASTRUCTURE
//*
//DEF      EXEC PGM=IEFBR14
//DEFDD    DD DSN=IBMUSER.ZSCH.DEF,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(TRK,(1,1,10)),
//            DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=0)
//*
//EXECLIB  EXEC PGM=IEFBR14
//EXECD    DD DSN=IBMUSER.ZSCH.EXEC,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(TRK,(1,1,10)),
//            DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=0)
//*
//ACTIVE   EXEC PGM=IEFBR14
//ACTDD    DD DSN=IBMUSER.ZSCH.ACTIVE,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(TRK,(1,1,10)),
//            DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=0)
//*
//PARM     EXEC PGM=IEFBR14
//PARMDD   DD DSN=IBMUSER.ZSCH.PARM,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(TRK,(1,1,10)),
//            DCB=(DSORG=PO,RECFM=FB,LRECL=80,BLKSIZE=0)
