//LAB01A  JOB (ACCT),'ZSCH TEST JOB',
//             CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//* Z/OS BATCH SCHEDULER - TEST WORKLOAD
//*
//STEP01   EXEC PGM=IEFBR14
